case/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                  https://gitlab.com/opensimproject/CfdOF                    |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// Patches to create.
patches
(
    {
        name inlet;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches ( "patch_1_.*" );
    }

    {
        name outlet;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches ( "patch_2_.*" );
    }

    {
        name constraint;
        patchInfo
        {
            type symmetry;
        }
        constructFrom patches;
        patches ( "patch_3_.*" );
    }

    {
        name wall;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches ( "patch_4_.*" );
    }

    {
        name defaultFaces;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches ( "patch_0_0" );
    }


);


// ************************************************************************* //
